app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "denmeeeee"], ["text", "olmuyoooor olmuyoor"], ["created_at", "2017-07-05 12:52:48.805102"], ["updated_at", "2017-07-05 12:52:48.805102"], ["user_id", 3]]