app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "1234"], ["body", "1234"], ["article_id", 11], ["created_at", "2017-07-06 09:13:34.692747"], ["updated_at", "2017-07-06 09:13:34.692747"], ["user_id", 2]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(comment_params)
    @comment.user = current_user

    @comment.save